{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/MatMul", "op": "MatMul", "input": ["inputs", "StatefulPartitionedCall/sequential_2_1/dense_4_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2_1/dense_4_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_2_1/dense_4_1/Tanh", "StatefulPartitionedCall/sequential_2_1/dense_5_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_2_1/dense_5_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2_1/dense_5_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/Cast/ReadVariableOp", "shape": [2, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Cast/ReadVariableOp", "shape": [4, 1], "dtype": "float32"}]}]}